Revit 2027 API
BuiltInFailures.ExtrusionFailures.CannotDrawExtrusionsError Property
 Can't make Extrusion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawExtrusionsError { get; }
Public Shared ReadOnly Property CannotDrawExtrusionsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawExtrusionsError {
	FailureDefinitionId^ get ();
}
static member CannotDrawExtrusionsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtrusionFailures Class
Autodesk.Revit.DB Namespace